Heliobteixeira/botieyes/esp-idf/sdkconfig.defaults
# TTGO LoRa32 Board Defaults
# ESP32 with integrated SSD1306 128x64 OLED (I2C)

# Board Selection
CONFIG_BOTIEYES_BOARD_TTGO_LORA32=y

# Display Configuration (I2C)
CONFIG_BOTIEYES_OLED_PROTOCOL_I2C=y
CONFIG_BOTIEYES_OLED_I2C_SDA=4
CONFIG_BOTIEYES_OLED_I2C_SCL=15
CONFIG_BOTIEYES_OLED_I2C_RST=16
CONFIG_BOTIEYES_OLED_I2C_FREQ=400000
CONFIG_BOTIEYES_OLED_I2C_ADDRESS=0x3C

# LED Configuration (GPIO)
CONFIG_BOTIEYES_LED_TYPE_GPIO=y
CONFIG_BOTIEYES_LED_GPIO_PIN=2

# ESP32 Configuration
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# WiFi Configuration
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# Task Watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# NVS Configuration
CONFIG_NVS_ENCRYPTION=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
